# Filter with More than One Condition (AND)

In [1]:
import pandas as pd
employees = pd.read_csv('employees.csv' , parse_dates=['Start Date', 'Last Login Time'])
employees['Senior Management'] = employees['Senior Management'].astype('bool')
employees['Gender'] = employees['Gender'].astype('category')
employees.head(n=2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-07-11 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-07-11 06:53:00,61933,4.170,True,NaN

In [2]:
employees['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: category
Categories (2, object): ['Female', 'Male']

In [4]:
mask_gender = employees['Gender'] == 'Male'

In [5]:
employees['Team']

0                 Marketing
1                       NaN
2                   Finance
3                   Finance
4           Client Services
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 1000, dtype: object

In [7]:
mask_team = employees['Team'] == 'Marketing'

In [10]:
employees[mask_gender & mask_team].head(n=2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-07-11 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2022-07-11 02:12:00,100612,13.645,False,Marketing